## Pandas Serisi Oluşurmak

In [5]:
import pandas as pd

In [6]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
pd.Series([10,22,322,34,5])

0     10
1     22
2    322
3     34
4      5
dtype: int64

# indexlerle beraber tutar

In [26]:
seri = pd.Series([10,22,322,34,5])

In [9]:
type(seri)

pandas.core.series.Series

# Serinin özelliklerini okuyabiliriz

In [10]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [11]:
seri.dtype

dtype('int64')

# büyüklüklerini sorgulayabiliriz

In [12]:
seri.size

5

# boyutlarını sorgulayabiliriz

In [13]:
seri.ndim

1

# içindeki değerleri sorgulayabliriz

In [14]:
seri.values

array([ 10,  22, 322,  34,   5], dtype=int64)

# Head ile baştan Tail ile sondan istediğimiz kadar değeri görebiliriz

In [15]:
seri.head(3)

0     10
1     22
2    322
dtype: int64

In [16]:
seri.tail(3)

2    322
3     34
4      5
dtype: int64

## index isimlendirmesi

In [17]:
pd.Series([99,22,332,94,5])

0     99
1     22
2    332
3     94
4      5
dtype: int64

# indexleri BAŞKA SAYILARLA değiştirme

In [32]:
pd.Series([99,22,332,94,5], index = [1,3,5,7,9])

1     99
3     22
5    332
7     94
9      5
dtype: int64

# indexleri string olarak değiştirme

In [33]:
pd.Series([99,22,332,94,5], index = ["a", "b", "c", "d", "e"])

a     99
b     22
c    332
d     94
e      5
dtype: int64

In [20]:
seri = pd.Series([99,22,332,94,5], index = ["a", "b", "c", "d", "e"])

In [21]:
seri["a"]

99

In [22]:
seri["a": "c"]

a     99
b     22
c    332
dtype: int64

# sözluk uzerinden liste oluşturmak

In [23]:
sozluk = {"reg":10, "log":11, "cart" :12}

In [24]:
seri = pd.Series(sozluk)
seri

reg     10
log     11
cart    12
dtype: int64

# iki seriyi birleştirererk seri oluşturma

In [25]:
pd.concat([seri,seri])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

## ELEMAN İŞLEMLERİ

In [6]:
import numpy as np
import pandas as pd
a = np.array([1,2,33,444,75])
seri = pd.Series(a)
seri

0      1
1      2
2     33
3    444
4     75
dtype: int32

In [7]:
seri[0]

1

In [8]:
seri[0:3]

0     1
1     2
2    33
dtype: int32

In [9]:
seri = pd.Series([121,200,150,99], index = ["reg", "loj", "cart", "rf"])
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [10]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [11]:
seri.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [12]:
list(seri.items())

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [13]:
seri.values

array([121, 200, 150,  99], dtype=int64)

# eleman sorgulama

In [17]:
"reg" in seri

True

In [18]:
"a" in seri

False

In [19]:
seri["reg"]

121

# fancy eleman

In [22]:
seri[["rf", "reg"]]

rf      99
reg    121
dtype: int64

In [23]:
seri["reg"] = 130

In [24]:
seri ["reg"]

130

In [25]:
seri["reg": "cart"]

reg     130
loj     200
cart    150
dtype: int64

### yukardaki işlemlerde görüldüğü üzere fancy slice vb işlemler numpy daki gibi geçerliliğini koruyor ve sözlük fonksiyonları da kullanılmaya devam ediyor.

## Pandas DataFrame Oluşturma

In [1]:
import pandas as pd

In [2]:
l = [1,2,39,67,90]

In [3]:
l

[1, 2, 39, 67, 90]

In [4]:
pd.DataFrame(l, columns = ["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [8]:
import numpy as np
m = np.arange(1,10).reshape ((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [9]:
pd.DataFrame(m, columns = ["var1", "var2", "var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

# df isimlendirme

In [10]:
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [11]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [12]:
df.columns = ("deg1", "deg2", "deg3")
df.columns

Index(['deg1', 'deg2', 'deg3'], dtype='object')

In [16]:
df.head()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [17]:
type(df)

pandas.core.frame.DataFrame

In [18]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [19]:
df.shape

(3, 3)

In [20]:
df.ndim

2

In [21]:
df.size

9

In [22]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [23]:
type(df.values)

numpy.ndarray

In [24]:
df.head()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [25]:
df.tail()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [26]:
df.head(1)

   deg1  deg2  deg3
0     1     2     3

In [27]:
df.tail(2)

   deg1  deg2  deg3
1     4     5     6
2     7     8     9

In [28]:
a = np.array([1,2,3,4,5])

In [30]:
pd.DataFrame(a, columns = ["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

## Eleman İşlemleri

In [149]:
import pandas as pd
import numpy as np

In [150]:
s1 = np.random.randint(10,size = 5)
s2 = np.random.randint(10,size = 5)
s3 = np.random.randint(10,size = 5)

In [151]:
sozluk = {"var1": s1, "var2": s2, "var3": s3}
sozluk

{'var1': array([1, 5, 9, 6, 1]),
 'var2': array([9, 8, 2, 3, 9]),
 'var3': array([9, 5, 7, 7, 5])}

In [152]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     1     9     9
1     5     8     5
2     9     2     7
3     6     3     7
4     1     9     5

In [153]:
df[0:1]

   var1  var2  var3
0     1     9     9

In [154]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [155]:
df.index = ["a", "b", "c", "d", "e"]
df

   var1  var2  var3
a     1     9     9
b     5     8     5
c     9     2     7
d     6     3     7
e     1     9     5

In [156]:
df["c": "e"]

   var1  var2  var3
c     9     2     7
d     6     3     7
e     1     9     5

# silme işlemi

In [157]:
df.drop("a", axis = 0)

   var1  var2  var3
b     5     8     5
c     9     2     7
d     6     3     7
e     1     9     5

In [158]:
df

   var1  var2  var3
a     1     9     9
b     5     8     5
c     9     2     7
d     6     3     7
e     1     9     5

In [159]:
df.drop("a", axis = 0, inplace = True)

# fancy ile birden çok silme

In [160]:
l = ["c", "e"]

In [161]:
df.drop(l)

   var1  var2  var3
b     5     8     5
d     6     3     7

In [162]:
df.drop(l, axis = 0)

   var1  var2  var3
b     5     8     5
d     6     3     7

# değişkenler için

In [163]:
"var1" in df

True

In [164]:
l = ["var1", "var4", "var2"]

In [165]:
for i in l:
    print(i in df)

True
False
True

In [166]:
df

   var1  var2  var3
b     5     8     5
c     9     2     7
d     6     3     7
e     1     9     5

In [167]:
df["var1"]

b    5
c    9
d    6
e    1
Name: var1, dtype: int32

In [168]:
df["var4"] = df["var1"] / df["var2"]
df

   var1  var2  var3      var4
b     5     8     5  0.625000
c     9     2     7  4.500000
d     6     3     7  2.000000
e     1     9     5  0.111111

# değişken silmek

In [169]:
df.drop("var4", axis = 1)

   var1  var2  var3
b     5     8     5
c     9     2     7
d     6     3     7
e     1     9     5

In [170]:
df

   var1  var2  var3      var4
b     5     8     5  0.625000
c     9     2     7  4.500000
d     6     3     7  2.000000
e     1     9     5  0.111111

# kalıcı olarak bir değeri silmek

In [171]:
df.drop("var4", axis = 1, inplace = True)

In [172]:
df

   var1  var2  var3
b     5     8     5
c     9     2     7
d     6     3     7
e     1     9     5

In [173]:
l = ["var1", "var2"]

In [174]:
df.drop(l, axis = 1)

   var3
b     5
c     7
d     7
e     5

In [175]:
df

   var1  var2  var3
b     5     8     5
c     9     2     7
d     6     3     7
e     1     9     5

## Gözlem ve değişken seçimi : loc & iloc

In [3]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df

   var1  var2  var3
0    14    14    27
1    20     5    15
2    10    29     1
3     6    23    13
4    28     8     1
5     5     9     9
6    11    10     9
7    18     4    28
8    21    10    23
9    23    13    16

# loc : tanımlandığı şekli ile seçim yapmak için kullanılır

In [11]:
df.loc[0:3]

   var1  var2  var3
0    14    14    27
1    20     5    15
2    10    29     1
3     6    23    13

# iloc : alışık olduğumuz indexleme mantığıyla seçim yapar

In [12]:
df.iloc[0:3]

   var1  var2  var3
0    14    14    27
1    20     5    15
2    10    29     1

In [18]:
df.iloc[0,0]

14

In [19]:
df.iloc[0:3,:2]

   var1  var2
0    14    14
1    20     5
2    10    29

In [20]:
df.loc[0:3,"var3"]

0    27
1    15
2     1
3    13
Name: var3, dtype: int32

In [21]:
df.iloc[0:3, "var3"]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [22]:
df.loc[0:3, "var3"]

0    27
1    15
2     1
3    13
Name: var3, dtype: int32

In [23]:
df.iloc[0:3, 1:3]

   var2  var3
0    14    27
1     5    15
2    29     1

In [24]:
df.iloc[0:3]

   var1  var2  var3
0    14    14    27
1    20     5    15
2    10    29     1

In [25]:
df.iloc[0:3]["var3"]

0    27
1    15
2     1
Name: var3, dtype: int32

In [1]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df

   var1  var2  var3
0     1    22    27
1     6    16     8
2     7    23    17
3    15     9    16
4     7     2    10
5     7    23    18
6    12    17    27
7    14    29    20
8    20     9    12
9    13     2    15

In [2]:
df["var2"]

0    22
1    16
2    23
3     9
4     2
5    23
6    17
7    29
8     9
9     2
Name: var2, dtype: int32

In [3]:
df["var2"][0:2]

0    22
1    16
Name: var2, dtype: int32

In [4]:
df[0:2]

   var1  var2  var3
0     1    22    27
1     6    16     8

In [5]:
df[0:2]["var1"]

0    1
1    6
Name: var1, dtype: int32

In [7]:
df[0:2][["var1", "var2"]]

   var1  var2
0     1    22
1     6    16

In [8]:
df

   var1  var2  var3
0     1    22    27
1     6    16     8
2     7    23    17
3    15     9    16
4     7     2    10
5     7    23    18
6    12    17    27
7    14    29    20
8    20     9    12
9    13     2    15

In [9]:
df.var1

0     1
1     6
2     7
3    15
4     7
5     7
6    12
7    14
8    20
9    13
Name: var1, dtype: int32

In [12]:
df[df.var1 > 10]

   var1  var2  var3
3    15     9    16
6    12    17    27
7    14    29    20
8    20     9    12
9    13     2    15

In [13]:
df[df.var1 > 10]["var1"]

3    15
6    12
7    14
8    20
9    13
Name: var1, dtype: int32

In [14]:
df[df.var1 > 10]["var2"]

3     9
6    17
7    29
8     9
9     2
Name: var2, dtype: int32

In [16]:
df[(df.var1 > 10) & (df.var3 > 17)]

   var1  var2  var3
6    12    17    27
7    14    29    20

In [21]:
df.loc[(df.var1 > 10), ["var1", "var2"]]

   var1  var2
3    15     9
6    12    17
7    14    29
8    20     9
9    13     2

In [22]:
df[(df.var1 > 10)] [["var1", "var2"]]

   var1  var2
3    15     9
6    12    17
7    14    29
8    20     9
9    13     2

## BİRLEŞTİRME İŞLEMLERİ

In [4]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (5,3))
df1 = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df1

   var1  var2  var3
0    26    13     4
1    15    17    20
2    16     5     9
3    15    11     8
4    20    13     8

In [6]:
df2 = df1 + 99
df2

   var1  var2  var3
0   125   112   103
1   114   116   119
2   115   104   108
3   114   110   107
4   119   112   107

In [7]:
pd.concat([df1,df2])

   var1  var2  var3
0    26    13     4
1    15    17    20
2    16     5     9
3    15    11     8
4    20    13     8
0   125   112   103
1   114   116   119
2   115   104   108
3   114   110   107
4   119   112   107

In [8]:
?pd.concat

Signature:
pd.concat(
    objs: Union[Iterable[~FrameOrSeries], Mapping[Union[Hashable, NoneType], ~FrameOrSeries]],
    axis=0,
    join='outer',
    ignore_index: bool = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: bool = False,
    sort: bool = False,
    copy: bool = True,
) -> Union[ForwardRef('DataFrame'), ForwardRef('Series')]
Docstring:
Concatenate pandas objects along a particular axis with optional set logic
along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned when `join`
    is 'outer'.
    This has no effect when ``join='inner'``, which already preserves
    the order of the non-concatenation axis.

    .. versionadded:: 0.23.0
    .. versionchanged:: 1.0.0

       Changed to not sort by default.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
Series.append : Concatenate Series.
DataFrame.append : Concatenate DataFrames.
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']
File:      c:\users\ereno\anaconda3\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [10]:
pd.concat([df1,df2], ignore_index=True)

   var1  var2  var3
0    26    13     4
1    15    17    20
2    16     5     9
3    15    11     8
4    20    13     8
5   125   112   103
6   114   116   119
7   115   104   108
8   114   110   107
9   119   112   107

In [13]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [14]:
df2.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [16]:
df2.columns = ["var1", "var2", "deg3"]
df2

   var1  var2  deg3
0   125   112   103
1   114   116   119
2   115   104   108
3   114   110   107
4   119   112   107

In [17]:
df1

   var1  var2  var3
0    26    13     4
1    15    17    20
2    16     5     9
3    15    11     8
4    20    13     8

In [18]:
pd.concat([df1, df2])

   var1  var2  var3   deg3
0    26    13   4.0    NaN
1    15    17  20.0    NaN
2    16     5   9.0    NaN
3    15    11   8.0    NaN
4    20    13   8.0    NaN
0   125   112   NaN  103.0
1   114   116   NaN  119.0
2   115   104   NaN  108.0
3   114   110   NaN  107.0
4   119   112   NaN  107.0

In [28]:
pd.concat([df1, df2], join = "inner")

   var1  var2
0    26    13
1    15    17
2    16     5
3    15    11
4    20    13
0   125   112
1   114   116
2   115   104
3   114   110
4   119   112

In [29]:
pd.concat([df1, df2])

   var1  var2  var3   deg3
0    26    13   4.0    NaN
1    15    17  20.0    NaN
2    16     5   9.0    NaN
3    15    11   8.0    NaN
4    20    13   8.0    NaN
0   125   112   NaN  103.0
1   114   116   NaN  119.0
2   115   104   NaN  108.0
3   114   110   NaN  107.0
4   119   112   NaN  107.0

## İLERİ BİRLEŞTİRME İŞLEMLERİ

In [15]:
import pandas as pd

# birebir birleştirme

In [16]:
df1 = pd.DataFrame({"calisanlar": ["Ali", "Veli", "Ayse", "Fatma"],
                    "grup": ["Muhasebe", "Muhendislik", "Muhendislik", "IK"]})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [17]:
df2 = pd.DataFrame({"calisanlar": ["Ali", "Veli", "Ayse", "Fatma"],
                    "ilk_giris": ["2010", "2009", "2014", "2019"]})
df2

  calisanlar ilk_giris
0        Ali      2010
1       Veli      2009
2       Ayse      2014
3      Fatma      2019

In [18]:
pd.merge(df1,df2)

  calisanlar         grup ilk_giris
0        Ali     Muhasebe      2010
1       Veli  Muhendislik      2009
2       Ayse  Muhendislik      2014
3      Fatma           IK      2019

In [31]:
pd.merge(df1,df2, on = "calisanlar")

  calisanlar         grup ilk_giris
0        Ali     Muhasebe      2010
1       Veli  Muhendislik      2009
2       Ayse  Muhendislik      2014
3      Fatma           IK      2019

# çoktan tekile birleştirme

In [24]:
df3 = pd.merge(df1,df2)
df3

  calisanlar         grup ilk_giris
0        Ali     Muhasebe      2010
1       Veli  Muhendislik      2009
2       Ayse  Muhendislik      2014
3      Fatma           IK      2019

In [26]:
df4 = pd.DataFrame({"grup": ["Muhasebe", "Muhendislik", "IK",],
                    "mudur": ["Caner", "Mustafa", "Eren"]})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           IK     Eren

In [27]:
pd.merge(df3,df4)

  calisanlar         grup ilk_giris    mudur
0        Ali     Muhasebe      2010    Caner
1       Veli  Muhendislik      2009  Mustafa
2       Ayse  Muhendislik      2014  Mustafa
3      Fatma           IK      2019     Eren

# çoktan çoka

In [28]:
df5 = pd.DataFrame({"grup": ["Muhasebe", "Muhasebe", "Muhendislik", "Muhendislik", "IK", "IK"],
                    "yetenekeler": ["matematik", "excel", "kodlama", "linux", "excel", "yonetim"]})
df5

          grup yetenekeler
0     Muhasebe   matematik
1     Muhasebe       excel
2  Muhendislik     kodlama
3  Muhendislik       linux
4           IK       excel
5           IK     yonetim

In [29]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [30]:
pd.merge(df1,df5)

  calisanlar         grup yetenekeler
0        Ali     Muhasebe   matematik
1        Ali     Muhasebe       excel
2       Veli  Muhendislik     kodlama
3       Veli  Muhendislik       linux
4       Ayse  Muhendislik     kodlama
5       Ayse  Muhendislik       linux
6      Fatma           IK       excel
7      Fatma           IK     yonetim

# TOPLULAŞTIRMA VE GRUPLAŞTIRMA(Aggregation & Grouping)

## TOPLULAŞTIRMAK

In [4]:
import seaborn as sns

In [6]:
df = sns.load_dataset("planets")
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [7]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [8]:
df.shape

(1035, 6)

In [9]:
df.size

6210

In [12]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [14]:
df["mass"].mean()

2.6381605847953233

In [16]:
df["mass"].count()

513

In [17]:
df["mass"].max()

25.0

In [18]:
df["mass"].min()

0.0036

In [19]:
df["mass"].sum()

1353.37638

In [20]:
df["mass"].std()

3.8186166509616046

In [21]:
df["mass"].var()

14.58183312700122

In [22]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [23]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [25]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

# GRUPLAMA İŞLEMERİ

In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame({ "gruplar": ["A","B","C","A","B","C"],
                  "veri": [10,11,52,23,43,55]}, columns=["gruplar", "veri"])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [6]:
df.groupby("gruplar")

In [7]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [8]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [9]:
import seaborn as sns

In [11]:
df = sns.load_dataset("planets")
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [12]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

## aşağıdaki kodda method verisine göre gruplanmasını ve bunu tutmasını istedik

In [13]:
df.groupby("method")

## aşağıdaki kodda ise method yöntemine göre grupamasını sonrasında ise orbitral değerlerini tutmasını istedik. daha aşaığısında ise de buna göre verdiğimiz komutları yerine getirip işlemleri yapmasını istedik

In [14]:
df.groupby("method")["orbital_period"]

In [15]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [16]:
df.groupby("method")["mass"].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [21]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

# İLERİ TOPLULAŞTIRMA İŞLEMLERİ 
## (Aggregate,filter,transform,apply)

In [7]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                   "degisken1": [10,23,33,22,11,99],
                   "degisken2": [100,253,333,262,111,969]},
                   columns = ["gruplar", "degisken1", "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

## aggregate

In [5]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A               16        181
B               17        182
C               66        651

In [8]:
df.groupby("gruplar").aggregate(["min", np.median, max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              33     66  99       333    651  969

In [10]:
df.groupby("gruplar").aggregate({"degisken1": "min", "degisken2": "max"})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

# Filter Fonksiyonu

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                   "degisken1": [10,23,33,22,11,99],
                   "degisken2": [100,253,333,262,111,969]},
                   columns = ["gruplar", "degisken1", "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [6]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [8]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [7]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

## yukardaki yaptığımız olay kütüphanelerde bulunan klask fonksiyonlardan ziyade kendi fonksiyonumuzu ihtiyacımıza göre şekillendirip bunu filter sayesinde kullanmamızı sağlıyor.

# TRANSFORM FONKSİYONU

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                   "degisken1": [10,23,33,22,11,99],
                   "degisken2": [100,253,333,262,111,969]},
                   columns = ["gruplar", "degisken1", "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [5]:
df["degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [10]:
df_a = df.iloc[:,1:3]

In [12]:
df_a.transform(lambda x: (x-x.mean()) / x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

# APPLY FONKSİYONU

In [1]:
import pandas as pd
import numpy as np

In [7]:
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                   "degisken1": [10,23,33,22,11,99],
                   "degisken2": [100,253,333,262,111,969]},
                   columns = ["gruplar", "degisken1", "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [4]:
df.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [5]:
df.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

In [8]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

In [9]:
df.groupby("gruplar").apply(np.mean)

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

# PİVOT TABLOLAR

In [3]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

## ilkel olarak cinsiyete göre gupla hayatta kalma değişkeninin ortalamasını almasını sağladık

In [4]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

## yukardaki işlemi data frame yani  tablo haline getirdik

In [5]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

## cinsiyet ve sınıf yapısına göre grupladık hayatta kalma oranlarını aggregate ve unstack yapısını da kullanarak  düzenli olarak yazdık

In [8]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

## unstack yapısını kullanmazsak tablo yapısı bu şekilde değişti (duruma göre okunabilirliği daha kolay veya zor olabilir)

In [9]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

## pivot ile pivot table

## pivot_table ile tabloyu oluşturduk

In [11]:
titanic.pivot_table("survived", index = "sex", columns = "class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [12]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

## age değişkenini sürekli değşikenden kategorik değişken olarak çevirip pivot tablosuna eklemek için bu şekilde yaptık ( 3 tane kategorisi var artık)

In [14]:
age = pd.cut(titanic["age"], [0,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [17]:
titanic.pivot_table("survived", ["sex",age], "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

In [18]:
titanic.pivot_table("survived", ["sex","age"], "class")

class         First  Second  Third
sex    age
female 0.75     NaN     NaN   1.00
       1.00     NaN     NaN   1.00
       2.00     0.0     1.0   0.25
       3.00     NaN     1.0   0.00
       4.00     NaN     1.0   1.00
...             ...     ...    ...
male   70.00    0.0     0.0    NaN
       70.50    NaN     NaN   0.00
       71.00    0.0     NaN    NaN
       74.00    NaN     NaN   0.00
       80.00    1.0     NaN    NaN

[145 rows x 3 columns]

## yukardaki agenin tırnak içerisinde olması ve olmaması arasındaki fark : tırnak içersine almadığımızda genel oalrak algılayıp bütün veriye bunu uygulaması

# DIŞ KAYNAKLI VERİ OKUMA

In [41]:
import pandas as pd

In [42]:
?pd.read_csv

Signature:
pd.read_csv(
    filepath_or_buffer: Union[str, pathlib.Path, IO[~AnyStr]],
    sep=',',
    delimiter=None,
    header='infer',
    names=None,
    index_col=None,
    usecols=None,
    squeeze=False,
    prefix=None,
    mangle_dupe_cols=True,
    dtype=None,
    engine=None,
    converters=None,
    true_values=None,
    false_values=None,
    skipinitialspace=False,
    skiprows=None,
    skipfooter=0,
    nrows=None,
    na_values=None,
    keep_default_na=True,
    na_filter=True,
    verbose=False,
    skip_blank_lines=True,
    parse_dates=False,
    infer_datetime_format=False,
    keep_date_col=False,
    date_parser=None,
    dayfirst=False,
    cache_dates=True,
    iterator=False,
    chunksize=None,
    compression='infer',
    thousands=None,
    decimal: str = '.',
    lineterminator=None,
    quotechar='"',
    quoting=0,
    doublequote=True,
    escapechar=None,
    comment=None,
    encoding=None,
    dialect=None,
    error_bad_lines=True,
    warn_bad_lines=True,
    delim_whitespace=False,
    low_memory=True,
    memory_map=False,
    float_precision=None,
)
Docstring:
Read a comma-separated values (csv) file into DataFrame.

Also supports optionally iterating or breaking of the file
into chunks.

Additional help can be found in the online docs for
`IO Tools <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

Parameters
----------
filepath_or_buffer : str, path object or file-like object
    Any valid string path is acceptable. The string could be a URL. Valid
    URL schemes include http, ftp, s3, gs, and file. For file URLs, a host is
    expected. A local file could be: file://localhost/path/to/table.csv.

    If you want to pass in a path object, pandas accepts any ``os.PathLike``.

    By file-like object, we refer to objects with a ``read()`` method, such as
    a file handler (e.g. via builtin ``open`` function) or ``StringIO``.
sep : str, default ','
    Delimiter to use. If sep is None, the C engine cannot automatically detect
    the separator, but the Python parsing engine can, meaning the latter will
    be used and automatically detect the separator by Python's builtin sniffer
    tool, ``csv.Sniffer``. In addition, separators longer than 1 character and
    different from ``'\s+'`` will be interpreted as regular expressions and
    will also force the use of the Python parsing engine. Note that regex
    delimiters are prone to ignoring quoted data. Regex example: ``'\r\t'``.
delimiter : str, default ``None``
    Alias for sep.
header : int, list of int, default 'infer'
    Row number(s) to use as the column names, and the start of the
    data.  Default behavior is to infer the column names: if no names
    are passed the behavior is identical to ``header=0`` and column
    names are inferred from the first line of the file, if column
    names are passed explicitly then the behavior is identical to
    ``header=None``. Explicitly pass ``header=0`` to be able to
    replace existing names. The header can be a list of integers that
    specify row locations for a multi-index on the columns
    e.g. [0,1,3]. Intervening rows that are not specified will be
    skipped (e.g. 2 in this example is skipped). Note that this
    parameter ignores commented lines and empty lines if
    ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
    data rather than the first line of the file.
names : array-like, optional
    List of column names to use. If the file contains a header row,
    then you should explicitly pass ``header=0`` to override the column names.
    Duplicates in this list are not allowed.
index_col : int, str, sequence of int / str, or False, default ``None``
  Column(s) to use as the row labels of the ``DataFrame``, either given as
  string name or column index. If a sequence of int / str is given, a
  MultiIndex is used.

  Note: ``index_col=False`` can be used to force pandas to *not* use the first
  column as the index, e.g. when you have a malformed file with delimiters at
  the end of each line.
usecols : list-like or callable, optional
    Return a subset of the columns. If list-like, all elements must either
    be positional (i.e. integer indices into the document columns) or strings
    that correspond to column names provided either by the user in `names` or
    inferred from the document header row(s). For example, a valid list-like
    `usecols` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
    Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
    To instantiate a DataFrame from ``data`` with element order preserved use
    ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]`` for columns
    in ``['foo', 'bar']`` order or
    ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
    for ``['bar', 'foo']`` order.

    If callable, the callable function will be evaluated against the column
    names, returning names where the callable function evaluates to True. An
    example of a valid callable argument would be ``lambda x: x.upper() in
    ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
    parsing time and lower memory usage.
squeeze : bool, default False
    If the parsed data only contains one column then return a Series.
prefix : str, optional
    Prefix to add to column numbers when no header, e.g. 'X' for X0, X1, ...
mangle_dupe_cols : bool, default True
    Duplicate columns will be specified as 'X', 'X.1', ...'X.N', rather than
    'X'...'X'. Passing in False will cause data to be overwritten if there
    are duplicate names in the columns.
dtype : Type name or dict of column -> type, optional
    Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32,
    'c': 'Int64'}
    Use `str` or `object` together with suitable `na_values` settings
    to preserve and not interpret dtype.
    If converters are specified, they will be applied INSTEAD
    of dtype conversion.
engine : {'c', 'python'}, optional
    Parser engine to use. The C engine is faster while the python engine is
    currently more feature-complete.
converters : dict, optional
    Dict of functions for converting values in certain columns. Keys can either
    be integers or column labels.
true_values : list, optional
    Values to consider as True.
false_values : list, optional
    Values to consider as False.
skipinitialspace : bool, default False
    Skip spaces after delimiter.
skiprows : list-like, int or callable, optional
    Line numbers to skip (0-indexed) or number of lines to skip (int)
    at the start of the file.

    If callable, the callable function will be evaluated against the row
    indices, returning True if the row should be skipped and False otherwise.
    An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
skipfooter : int, default 0
    Number of lines at bottom of file to skip (Unsupported with engine='c').
nrows : int, optional
    Number of rows of file to read. Useful for reading pieces of large files.
na_values : scalar, str, list-like, or dict, optional
    Additional strings to recognize as NA/NaN. If dict passed, specific
    per-column NA values.  By default the following values are interpreted as
    NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
    '1.#IND', '1.#QNAN', '<NA>', 'N/A', 'NA', 'NULL', 'NaN', 'n/a',
    'nan', 'null'.
keep_default_na : bool, default True
    Whether or not to include the default NaN values when parsing the data.
    Depending on whether `na_values` is passed in, the behavior is as follows:

    * If `keep_default_na` is True, and `na_values` are specified, `na_values`
      is appended to the default NaN values used for parsing.
    * If `keep_default_na` is True, and `na_values` are not specified, only
      the default NaN values are used for parsing.
    * If `keep_default_na` is False, and `na_values` are specified, only
      the NaN values specified `na_values` are used for parsing.
    * If `keep_default_na` is False, and `na_values` are not specified, no
      strings will be parsed as NaN.

    Note that if `na_filter` is passed in as False, the `keep_default_na` and
    `na_values` parameters will be ignored.
na_filter : bool, default True
    Detect missing value markers (empty strings and the value of na_values). In
    data without any NAs, passing na_filter=False can improve the performance
    of reading a large file.
verbose : bool, default False
    Indicate number of NA values placed in non-numeric columns.
skip_blank_lines : bool, default True
    If True, skip over blank lines rather than interpreting as NaN values.
parse_dates : bool or list of int or names or list of lists or dict, default False
    The behavior is as follows:

    * boolean. If True -> try parsing the index.
    * list of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
      each as a separate date column.
    * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
      a single date column.
    * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
      result 'foo'

    If a column or index cannot be represented as an array of datetimes,
    say because of an unparseable value or a mixture of timezones, the column
    or index will be returned unaltered as an object data type. For
    non-standard datetime parsing, use ``pd.to_datetime`` after
    ``pd.read_csv``. To parse an index or column with a mixture of timezones,
    specify ``date_parser`` to be a partially-applied
    :func:`pandas.to_datetime` with ``utc=True``. See
    :ref:`io.csv.mixed_timezones` for more.

    Note: A fast-path exists for iso8601-formatted dates.
infer_datetime_format : bool, default False
    If True and `parse_dates` is enabled, pandas will attempt to infer the
    format of the datetime strings in the columns, and if it can be inferred,
    switch to a faster method of parsing them. In some cases this can increase
    the parsing speed by 5-10x.
keep_date_col : bool, default False
    If True and `parse_dates` specifies combining multiple columns then
    keep the original columns.
date_parser : function, optional
    Function to use for converting a sequence of string columns to an array of
    datetime instances. The default uses ``dateutil.parser.parser`` to do the
    conversion. Pandas will try to call `date_parser` in three different ways,
    advancing to the next if an exception occurs: 1) Pass one or more arrays
    (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
    string values from the columns defined by `parse_dates` into a single array
    and pass that; and 3) call `date_parser` once for each row using one or
    more strings (corresponding to the columns defined by `parse_dates`) as
    arguments.
dayfirst : bool, default False
    DD/MM format dates, international and European format.
cache_dates : bool, default True
    If True, use a cache of unique, converted dates to apply the datetime
    conversion. May produce significant speed-up when parsing duplicate
    date strings, especially ones with timezone offsets.

    .. versionadded:: 0.25.0
iterator : bool, default False
    Return TextFileReader object for iteration or getting chunks with
    ``get_chunk()``.
chunksize : int, optional
    Return TextFileReader object for iteration.
    See the `IO Tools docs
    <https://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
    for more information on ``iterator`` and ``chunksize``.
compression : {'infer', 'gzip', 'bz2', 'zip', 'xz', None}, default 'infer'
    For on-the-fly decompression of on-disk data. If 'infer' and
    `filepath_or_buffer` is path-like, then detect compression from the
    following extensions: '.gz', '.bz2', '.zip', or '.xz' (otherwise no
    decompression). If using 'zip', the ZIP file must contain only one data
    file to be read in. Set to None for no decompression.
thousands : str, optional
    Thousands separator.
decimal : str, default '.'
    Character to recognize as decimal point (e.g. use ',' for European data).
lineterminator : str (length 1), optional
    Character to break file into lines. Only valid with C parser.
quotechar : str (length 1), optional
    The character used to denote the start and end of a quoted item. Quoted
    items can include the delimiter and it will be ignored.
quoting : int or csv.QUOTE_* instance, default 0
    Control field quoting behavior per ``csv.QUOTE_*`` constants. Use one of
    QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).
doublequote : bool, default ``True``
   When quotechar is specified and quoting is not ``QUOTE_NONE``, indicate
   whether or not to interpret two consecutive quotechar elements INSIDE a
   field as a single ``quotechar`` element.
escapechar : str (length 1), optional
    One-character string used to escape other characters.
comment : str, optional
    Indicates remainder of line should not be parsed. If found at the beginning
    of a line, the line will be ignored altogether. This parameter must be a
    single character. Like empty lines (as long as ``skip_blank_lines=True``),
    fully commented lines are ignored by the parameter `header` but not by
    `skiprows`. For example, if ``comment='#'``, parsing
    ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in 'a,b,c' being
    treated as the header.
encoding : str, optional
    Encoding to use for UTF when reading/writing (ex. 'utf-8'). `List of Python
    standard encodings
    <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .
dialect : str or csv.Dialect, optional
    If provided, this parameter will override values (default or not) for the
    following parameters: `delimiter`, `doublequote`, `escapechar`,
    `skipinitialspace`, `quotechar`, and `quoting`. If it is necessary to
    override values, a ParserWarning will be issued. See csv.Dialect
    documentation for more details.
error_bad_lines : bool, default True
    Lines with too many fields (e.g. a csv line with too many commas) will by
    default cause an exception to be raised, and no DataFrame will be returned.
    If False, then these "bad lines" will dropped from the DataFrame that is
    returned.
warn_bad_lines : bool, default True
    If error_bad_lines is False, and warn_bad_lines is True, a warning for each
    "bad line" will be output.
delim_whitespace : bool, default False
    Specifies whether or not whitespace (e.g. ``' '`` or ``'    '``) will be
    used as the sep. Equivalent to setting ``sep='\s+'``. If this option
    is set to True, nothing should be passed in for the ``delimiter``
    parameter.
low_memory : bool, default True
    Internally process the file in chunks, resulting in lower memory use
    while parsing, but possibly mixed type inference.  To ensure no mixed
    types either set False, or specify the type with the `dtype` parameter.
    Note that the entire file is read into a single DataFrame regardless,
    use the `chunksize` or `iterator` parameter to return the data in chunks.
    (Only valid with C parser).
memory_map : bool, default False
    If a filepath is provided for `filepath_or_buffer`, map the file object
    directly onto memory and access the data directly from there. Using this
    option can improve performance because there is no longer any I/O overhead.
float_precision : str, optional
    Specifies which converter the C engine should use for floating-point
    values. The options are `None` for the ordinary converter,
    `high` for the high-precision converter, and `round_trip` for the
    round-trip converter.

Returns
-------
DataFrame or TextParser
    A comma-separated values (csv) file is returned as two-dimensional
    data structure with labeled axes.

See Also
--------
DataFrame.to_csv : Write DataFrame to a comma-separated values (csv) file.
read_csv : Read a comma-separated values (csv) file into DataFrame.
read_fwf : Read a table of fixed-width formatted lines into DataFrame.

Examples
--------
>>> pd.read_csv('data.csv')  # doctest: +SKIP
File:      c:\users\ereno\anaconda3\lib\site-packages\pandas\io\parsers.py
Type:      function

In [43]:
#cvs okuma
pd.read_csv("reading_data/ornekcsv.csv", sep = ";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [44]:
#txt okuma
pd.read_csv("reading_data/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [45]:
#excel okuma
pd.read_excel("reading_data/ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [46]:
df = pd.read_excel("reading_data/ornekx.xlsx")
type(df)

pandas.core.frame.DataFrame

In [47]:
df.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [48]:
df.tail()

      a   b     c
8    56  21   7.0
9   346   2   8.0
10    5   1   8.0
11  456  21   8.0
12    3  12  88.0

In [49]:
df.columns = ("A", "B", "C")

In [50]:
df

      A    B     C
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [55]:
#sıfırdan txt okuma(githuba gidip tek bir dataya tek tıklayıp sağ taraftan raw seçtik çıkan datayı kopala yapıştırla txt olarak burda kaydettik
titanic = pd.read_csv("titanic_github_data.txt")

In [56]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True